app/controllers/articles_controller.rb

  def create
    redirect_to :articles

    @title = params[:article][:title]
    @text  = params[:article][:text]
    @admin_name = session[:un]
    # puts  @title, @text
    Article.insert(@title, @text, @admin_name)
---
INSERT INTO "articles" ("title", "content", "admin_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def index
    @articles = Article.all.reverse_order
---
SELECT "articles".* FROM "articles"  ORDER BY "articles"."id" DESC

  def show
    id = params[:id].to_i
    # puts id
    if id == 1
      puts '11'
    end
    @article = Article.find_by_id(id)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."article_id" = ? LIMIT 1  [["article_id", "1"]]

  def modify
    if session[:ut] != 'admin'
      redirect_to welcome_error_path
    end

    @articles = Article.all
    # delete an article
    if params[:del]
      @del_id = params[:del]
      Article.delete(@del_id)
---
SELECT "articles".* FROM "articles"
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 4]]

  def edt
    if session[:ut] != 'admin'
      redirect_to welcome_error_path
    end

    @edt_id = params[:edt]
    session[:edt_id] = @edt_id
    @article = Article.find(@edt_id)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 3]]

  def edt_handle
    # handle article edit post request
    if params[:articles_edt][:title]
      Article.update(session[:edt_id], :title=>params[:articles_edt][:title],
      :content => params[:articles_edt][:text])
---
UPDATE "articles" SET "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["content", "江苏 常熟一家美甲店的监控录像显示，两名女子互相撕咬暴打。原来前一天晚上，这两名好友在微信里抢红包，其中一名先抢到了一个，却马上就退群了。两个人隔空对骂了一晚上，第二天在美甲店又打了起来。"], ["updated_at", "2016-01-01 11:50:34.853430"], ["id", 2]]