app/controllers/memberships_controller.rb

  def signup_handle
    # handle post of member regist

    # Two passwords are not the same.
    if params[:signup][:password]!=params[:signup][:confirm]
      session[:err] = 1
      redirect_to :memberships_signup
    else
      session[:err] = 0
      # Insert the membership data into database.
      Member.insert(params[:signup][:user], params[:signup][:password], params[:signup][:phone],
      params[:signup][:qq], params[:signup][:is_leader])
---
INSERT INTO "members" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-01-01 06:27:03.643891"], ["updated_at", "2016-01-01 06:27:03.643891"]]