app/controllers/notices_controller.rb

  def create
    redirect_to :notices

    @title = params[:notice][:title]
    @text  = params[:notice][:text]
    @admin_name = session[:un]
    # puts  @title, @text
    Notice.insert(@title, @text, @admin_name)
---
INSERT INTO "notices" ("title", "content", "admin_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "今天中午开会"], ["content", "中午12点45到下午1点50开会"], ["admin_id", "administrator"], ["created_at", "2015-12-31 02:11:58.831635"], ["updated_at", "2015-12-31 02:11:58.831635"]]

  def index
    @notices = Notice.all
---
SELECT "notices".* FROM "notices"  ORDER BY "notices"."id" DESC