app/controllers/projects_controller.rb

  def create
    redirect_to :projects

    @title = params[:project][:title]
    @text = params[:project][:text]
    # puts  @title, @text
    Project.insert(@title, @text)
---
INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "ROR开发一个网站"], ["description", "使用ROR开发一个简单容易使用的内容发布系统，时间待定。"], ["created_at", "2015-12-31 02:41:16.137391"], ["updated_at", "2015-12-31 02:41:16.137391"]]

  def index
    @projects = Project.all.reverse_order
---
SELECT "projects".* FROM "projects"  ORDER BY "projects"."id" DESC

  def modify
    if session[:ut] != 'admin'
      redirect_to welcome_error_path
    end

    @projects = Project.all
---
SELECT "projects".* FROM "projects"

  def edt
    if session[:ut] != 'admin'
      redirect_to welcome_error_path
    end

    @edt_id = params[:edt]
    session[:edt_id] = @edt_id
    @project = Project.find(@edt_id)
    @status = Status.find_by_project_id(@edt_id.to_i)

    if params[:edt]
      session[:edt] = params[:edt]

      @members_added = Belong.find_by_project_id(params[:edt])
      @members_all = Member.all
      @map = {}

      # get map of whom are in group
      @members_all.each do |m|
        @members_added.each do |a|
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", 2]]
SELECT "projects".* FROM "projects"

  def edt_handle
    # handle project edit post request
    if params[:projects_edt][:title]
      Project.update(session[:edt_id], :name => params[:projects_edt][:title],
                     :description => params[:projects_edt][:description])
---
UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["description", "这个需要勇气"], ["updated_at", "2016-01-01 12:45:37.839241"], ["id", 2]]