app/controllers/welcome_controller.rb

SELECT "articles".* FROM "articles"  ORDER BY "articles"."id" DESC
SELECT "notices".* FROM "notices"  ORDER BY "notices"."id" DESC
SELECT "projects".* FROM "projects"  ORDER BY "projects"."id" DESC
---
  def index
    @articles = Article.all
    @notices  = Notice.all
    @projects = Project.all